Revit 2027 API
Speckle.TextureAngle Property
 The property labeled "Angle" from the "Speckle" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string TextureAngle { get; }
Public Shared ReadOnly Property TextureAngle As String
	Get
public:
static property String^ TextureAngle {
	String^ get ();
}
static member TextureAngle : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyDoubleArray3d".
See Also
Reference
Speckle Class
Autodesk.Revit.DB.Visual Namespace